/*
 */
/** 		Copyright OMRON Corporation. 1989, 1990, 1991, 1992, 1992
 *
 * Permission to use, copy, modify, distribute, and sell this software and its 
 * documentation for any purpose is hereby granted without fee, provided 
 * that all of the following conditions are satisfied:
 *
 * <1>	The above copyright notices appear in all copies
 * <2>	Both the copyright notices and this permission notice appear in 
 *	supporting documentation
 * <3>	The name of "cWnn" isn't changed unless substantial modifications 
 * 	are made
 * <4>	Following words followed by the above copyright notices appear
 *    	in all supporting documentation of software based on "cWnn":
 *
 * 	This software is based on the original version of cWnn developed 
 *	by OMRON Corporation and Wnn developed by Kyoto University Research 
 *	Institute for Mathematical Sciences (KURIMS), OMRON Corporation and 
 * 	ASTEC Inc."
 *
 * <5>	The names of OMRON may not be used in advertising or publicity 
 *	pertaining to distribution of the software without specific, written 
 *	prior permission
 *
 *  OMRON Corporation makes no representations about the suitability of this 
 *  software for any purpose.  It is provided "as is" without express or 
 *  implied warranty.
 *
 *  Wnn consortium is one of distributors of the official Wnn source code
 *  release.  Wnn consortium also makes no representations about the
 *  suitability of this software for any purpose.  It is provided "as is"
 *  without express or implied warranty.
 *
 *  OMRON AND WNN CONSORTIUM DISCLAIM ALL WARRANTIES WITH REGARD TO THIS
 *  SOFTWARE, INCLUDING ALL IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS,
 *  IN NO EVENT SHALL OMRON OR WNN CONSORTIUM BE LIABLE FOR ANY SPECIAL,
 *  INDIRECT OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES WHATSOEVER RESULTING FROM
 *  LOSS OF USE, DATA OR PROFITS, WHETHER IN AN ACTION OF CONTRACT, NEGLIGENCE
 *  OR OTHER TORTIOUS ACTION, ARISING OUT OF OR IN CONNECTION WITH THE USE OR
 *  PERFORMANCE OF THIS SOFTWARE.
 *
 *  This sofeware is developed by OMRON Corporation, based on the original 
 *  version of Wnn which was developed by Kyoto University Research Institute 
 *  for Mathematical Sciences (KURIMS), OMRON Corporation and ASTEC Inc. 
 *
 *  	Copyright Kyoto University Research Institute for Mathematical 
 *		Sciences 1987,1988,1989,1990,1991, 1992
 * 	Copyright OMRON Corporation 1987,1988,1989,1990,1991, 1992
 *	Copyright ASTEC Inc. 1987, 1988,1989,1990,1991, 1992
 *
 *  Contact:	Tel:   	+81-75-951-5111
 *		Fax:   	+81-75-955-2442
 *		E-mail: zhong@ari.ncl.omron.co.jp
**/
/**  cWnn  Version 1.1	 **/

#include  <ctype.h>
#include "commonhd.h"
#ifdef CHINESE
#include "cplib.h"

/* zy_shengmu_tbl: ShengMu table of Chinese ZhuYin  */
char 	*zy_shengmu_tbl[ZY_NUM_SHENGMU] = {
	
	"", "ŽÅ", "ŽØ",  "ŽÔ", "ŽÉ",    /*	"", "B", "C",  "Ch", "D",   */
	"ŽÈ", "ŽÍ", "ŽÏ", "ŽÐ", "ŽÎ",    /*	"F", "G", "H",  "J",  "K", */
	"ŽÌ", "ŽÇ", "ŽË", "ŽÆ", "ŽÑ",    /*	"L", "M", "N",  "P",  "Q",  */
	"ŽÖ", "ŽÙ", "ŽÕ", "ŽÊ", "Žè",    /*	"R", "S", "Sh", "T",  "W",  */
	"ŽÒ", "Žç", "Ž×", "ŽÓ"          /*	"X", "Y", "Z",  "Zh"   */
	};
	

/* zy_yunmu_tbl: YunMu table of Chinese ZhuYin  */
char 	*zy_yunmu_tbl[ZY_NUM_YUNMU*5] = {
/* 3.20
	"",     "",     "",      "",      "", 
*/
	"ŽÀ",   "ŽÁ",   "ŽÂ",    "ŽÃ",    "ŽÄ",		/* a 	*/
	"ŽÚŽÀ",   "ŽÚŽÁ",   "ŽÚŽÂ",    "ŽÚŽÃ",    "ŽÚŽÄ",		/* a 	*/
	"ŽÞŽÀ",   "ŽÞŽÁ",   "ŽÞŽÂ",    "ŽÞŽÃ",    "ŽÞŽÄ",		/* ai 	*/
	"ŽâŽÀ",   "ŽâŽÁ",   "ŽâŽÂ",    "ŽâŽÃ",    "ŽâŽÄ",		/* an 	*/
	"ŽäŽÀ",   "ŽäŽÁ",   "ŽäŽÂ",    "ŽäŽÃ",    "ŽäŽÄ",		/* ang 	*/
	"ŽàŽÀ",   "ŽàŽÁ",   "ŽàŽÂ",    "ŽàŽÃ",    "ŽàŽÄ",		/* ao 	*/
	"ŽÜŽÀ",   "ŽÜŽÁ",   "ŽÜŽÂ",    "ŽÜŽÃ",    "ŽÜŽÄ",		/* e 	*/
	"ŽßŽÀ",   "ŽßŽÁ",   "ŽßŽÂ",    "ŽßŽÃ",    "ŽßŽÄ",		/* ei 	*/
	"ŽãŽÀ",   "ŽãŽÁ",   "ŽãŽÂ",    "ŽãŽÃ",    "ŽãŽÄ",		/* en 	*/
	"ŽåŽÀ",   "ŽåŽÁ",   "ŽåŽÂ",    "ŽåŽÃ",    "ŽåŽÄ",		/* eng 	*/
	"ŽæŽÀ",   "ŽæŽÁ",   "ŽæŽÂ",    "ŽæŽÃ",    "ŽæŽÄ",		/* er 	*/
	"ŽçŽÀ",   "ŽçŽÁ",   "ŽçŽÂ",    "ŽçŽÃ",    "ŽçŽÄ",		/* i	*/
	"ŽçŽÚŽÀ",  "ŽçŽÚŽÁ",  "ŽçŽÚŽÂ",   "ŽçŽÚŽÃ",   "ŽçŽÚŽÄ",	/* ia	*/
	"ŽçŽâŽÀ",  "ŽçŽâŽÁ",  "ŽçŽâŽÂ",   "ŽçŽâŽÃ",   "ŽçŽâŽÄ",	/* ian	*/
	"ŽçŽäŽÀ",  "ŽçŽäŽÁ",  "ŽçŽäŽÂ",   "ŽçŽäŽÃ",   "ŽçŽäŽÄ",	/* iang	*/
	"ŽçŽàŽÀ",  "ŽçŽàŽÁ",  "ŽçŽàŽÂ",   "ŽçŽàŽÃ",   "ŽçŽàŽÄ",	/* iao	*/
	"ŽçŽÝŽÀ",  "ŽçŽÝŽÁ",  "ŽçŽÝŽÂ",   "ŽçŽÝŽÃ",   "ŽçŽÝŽÄ",	/* ie	*/
	"ŽçŽãŽÀ",  "ŽçŽãŽÁ",  "ŽçŽãŽÂ",   "ŽçŽãŽÃ",   "ŽçŽãŽÄ",	/* in	*/
	"ŽçŽåŽÀ",  "ŽçŽåŽÁ",  "ŽçŽåŽÂ",   "ŽçŽåŽÃ",   "ŽçŽåŽÄ",	/* ing	*/
	"ŽéŽåŽÀ",  "ŽéŽåŽÁ",  "ŽéŽåŽÂ",   "ŽéŽåŽÃ",   "ŽéŽåŽÄ",	/* iong	*/
	"ŽçŽáŽÀ",  "ŽçŽáŽÁ",  "ŽçŽáŽÂ",   "ŽçŽáŽÃ",   "ŽçŽáŽÄ",	/* iu	*/
	"ŽÇŽÀ",   "ŽÇŽÁ",   "ŽÇŽÂ",    "ŽÇŽÃ",    "ŽÇŽÄ",		/* m	*/
	"ŽËŽÀ",   "ŽËŽÁ",   "ŽËŽÂ",    "ŽËŽÃ",    "ŽËŽÄ",		/* n 	*/
	"@ŽÀ",    "@ŽÁ",   "@ŽÂ",    "@ŽÃ",    "@ŽÄ",	/* ng	*/
	"ŽÛŽÀ",   "ŽÛŽÁ",   "ŽÛŽÂ",    "ŽÛŽÃ",    "ŽÛŽÄ",		/* o 	*/
	"ŽèŽåŽÀ",  "ŽèŽåŽÁ",  "ŽèŽåŽÂ",   "ŽèŽåŽÃ",   "ŽèŽåŽÄ",	/* ong	*/
	"ŽáŽÀ",   "ŽáŽÁ",   "ŽáŽÂ",    "ŽáŽÃ",    "ŽáŽÄ",		/* ou	*/
	"ŽèŽÀ",   "ŽèŽÁ",   "ŽèŽÂ",    "ŽèŽÃ",    "ŽèŽÄ",		/* u	*/
	"ŽèŽÚŽÀ",  "ŽèŽÚŽÁ",  "ŽèŽÚŽÂ",   "ŽèŽÚŽÃ",   "ŽèŽÚŽÄ",	/* ua	*/
	"ŽèŽÞŽÀ",  "ŽèŽÞŽÁ",  "ŽèŽÞŽÂ",   "ŽèŽÞŽÃ",   "ŽèŽÞŽÄ",	/* uai	*/
	"ŽèŽâŽÀ",  "ŽèŽâŽÁ",  "ŽèŽâŽÂ",   "ŽèŽâŽÃ",   "ŽèŽâŽÄ",	/* uan	*/
	"ŽèŽäŽÀ",  "ŽèŽäŽÁ",  "ŽèŽäŽÂ",   "ŽèŽäŽÃ",   "ŽèŽäŽÄ",	/* uang	*/
	"ŽéŽÝŽÀ",  "ŽéŽÝŽÁ",  "ŽéŽÝŽÂ",   "ŽéŽÝŽÃ",   "ŽéŽÝŽÄ",	/* ue	*/
	"ŽèŽßŽÀ",  "ŽèŽßŽÁ",  "ŽèŽßŽÂ",   "ŽèŽßŽÃ",   "ŽèŽßŽÄ",	/* ui	*/
	"ŽèŽãŽÀ",  "ŽèŽãŽÁ",  "ŽèŽãŽÂ",   "ŽèŽãŽÃ",   "ŽèŽãŽÄ",	/* un 	*/
	"ŽèŽÛŽÀ",  "ŽèŽÛŽÁ",  "ŽèŽÛŽÂ",   "ŽèŽÛŽÃ",   "ŽèŽÛŽÄ",	/* uo	*/
	"ŽéŽÀ",   "ŽéŽÁ",   "ŽéŽÂ",    "ŽéŽÃ",    "ŽéŽÄ",		/* Ž¹	*/
	"ŽéŽÝŽÀ",  "ŽéŽÝŽÁ",  "ŽéŽÝŽÂ",   "ŽéŽÝŽÃ",   "ŽéŽÝŽÄ",	/* Ž¹e	*/
	"0ŽÀ",    "1ŽÁ",    "2ŽÂ",     "3ŽÃ",     "4ŽÄ",	/* undefinited YunMu */
	"ŽéŽâŽÀ",  "ŽéŽâŽÁ",  "ŽéŽâŽÂ",   "ŽéŽâŽÃ",   "ŽéŽâŽÄ",	/* Ž¹an,	only ZhuYin */
	"ŽéŽãŽÀ",  "ŽéŽãŽÁ",  "ŽéŽãŽÂ",   "ŽéŽãŽÃ",   "ŽéŽãŽÄ",	/* Ž¹n,	only ZhuYin */
	};


/* zhuyin_tbl:  size is ZY_NUM_SHENGMU*ZY_NUM_YUNMU, including empty ShengMu */
/*      	empty YunMu and undefinited ShengMu '-' */

int  zhuyin_tbl[ZY_NUM_SHENGMU*ZY_NUM_YUNMU] = {
					    	
/* empty ShengMu */
0X0000,0X8000,0X8000,0X8000,0X8000,0X8000,0X8000,0X8000,0X8000,0X8000,
0X8000,0X0000,0X0000,0X0000,0X0000,0X0000,0X9586,0X0000,0X9592,0X9599,
0X0000,0X8000,0X8000,0X8000,0X8000,0X0000,0X8000,0X0000,0X0000,0X0000,
0X0000,0X0000,0X0000,0X0000,0X0000,0X0000,0X959B,0X95A0,0X0000,0X959E,
0X95A2,

/* SHengMu B */
0X0000,0X8000,0X8000,0X8000,0X8000,0X8000,0X0000,0X8000,0X8000,0X8000,
0X0000,0X8000,0X0000,0X8000,0X0000,0X8000,0X8000,0X8000,0X8000,0X0000,
0X0000,0X0000,0X0000,0X0000,0X8000,0X0000,0X0000,0X8000,0X0000,0X0000,
0X0000,0X0000,0X0000,0X0000,0X0000,0X0000,0X0000,0X0000,0X8000,0X0000,
0X0000,

/* ShengMu C */
0X828B,0X8000,0X8000,0X8000,0X8000,0X8000,0X8000,0X0000,0X8000,0X8000,
0X0000,0X0280,0X0000,0X0000,0X0000,0X0000,0X0000,0X0000,0X0000,0X0000,
0X0000,0X0000,0X0000,0X0000,0X0000,0X8000,0X8000,0X8000,0X0000,0X0000,
0X8000,0X0000,0X0000,0X8000,0X8000,0X8000,0X0000,0X0000,0X8000,0X0000,
0X0000,

/* ShengMu Ch */
0X838B,0X8000,0X8000,0X8000,0X8000,0X8000,0X8000,0X0000,0X8000,0X8000,
0X0000,0X0380,0X0000,0X0000,0X0000,0X0000,0X0000,0X0000,0X0000,0X0000,
0X0000,0X0000,0X0000,0X0000,0X0000,0X8000,0X8000,0X8000,0X0000,0X8000,
0X8000,0X8000,0X0000,0X8000,0X8000,0X8000,0X0000,0X0000,0X8000,0X0000,
0X0000,

/* ShengMu D */
0X0000,0X8000,0X8000,0X8000,0X8000,0X8000,0X8000,0X8000,0X8000,0X8000,
0X0000,0X8000,0X8000,0X8000,0X0000,0X8000,0X8000,0X0000,0X8000,0X0000,
0X8000,0X0000,0X0000,0X0000,0X0000,0X8000,0X8000,0X8000,0X0000,0X0000,
0X8000,0X0000,0X0000,0X8000,0X8000,0X8000,0X0000,0X0000,0X8000,0X0000,
0X0000,

/* ShengMu F */
0X0000,0X8000,0X0000,0X8000,0X8000,0X0000,0X0000,0X8000,0X8000,0X8000,
0X0000,0X0000,0X0000,0X0000,0X0000,0X0000,0X0000,0X0000,0X0000,0X0000,
0X0000,0X0000,0X0000,0X0000,0X8000,0X0000,0X8000,0X8000,0X0000,0X0000,
0X0000,0X0000,0X0000,0X0000,0X0000,0X0000,0X0000,0X0000,0X8000,0X0000,
0X0000,

/* ShengMu G */
0X0000,0X8000,0X8000,0X8000,0X8000,0X8000,0X8000,0X8000,0X8000,0X8000,
0X0000,0X0000,0X0000,0X0000,0X0000,0X0000,0X0000,0X0000,0X0000,0X0000,
0X0000,0X0000,0X0000,0X0000,0X0000,0X8000,0X8000,0X8000,0X8000,0X8000,
0X8000,0X8000,0X0000,0X8000,0X8000,0X8000,0X0000,0X0000,0X8000,0X0000,
0X0000,

/* ShengMu H */
0X0000,0X8000,0X8000,0X8000,0X8000,0X8000,0X8000,0X8000,0X8000,0X8000,
0X0000,0X0000,0X0000,0X0000,0X0000,0X0000,0X0000,0X0000,0X0000,0X0000,
0X0000,0X8000,0X0000,0X8000,0X0000,0X8000,0X8000,0X8000,0X8000,0X8000,
0X8000,0X8000,0X0000,0X8000,0X8000,0X8000,0X0000,0X0000,0X8000,0X0000,
0X0000,

/* ShengMu J */
0X0000,0X0000,0X0000,0X0000,0X0000,0X0000,0X0000,0X0000,0X0000,0X0000,
0X0000,0X8000,0X8000,0X8000,0X8000,0X8000,0X8000,0X8000,0X8000,0X8000,
0X8000,0X0000,0X0000,0X0000,0X0000,0X0000,0X0000,0X08A4,0X0000,0X0000,
0X08A7,0X0000,0X08A5,0X0000,0X08A8,0X0000,0X889B,0X88A0,0X8000,0X889E,
0X88A2,

/* ShengMu K */
0X0000,0X8000,0X8000,0X8000,0X8000,0X8000,0X8000,0X8000,0X8000,0X8000,
0X0000,0X0000,0X0000,0X0000,0X0000,0X0000,0X0000,0X0000,0X0000,0X0000,
0X0000,0X0000,0X0000,0X0000,0X0000,0X8000,0X8000,0X8000,0X8000,0X8000,
0X8000,0X8000,0X0000,0X8000,0X8000,0X8000,0X0000,0X0000,0X8000,0X0000,
0X0000,

/* ShengMu L */
0X0000,0X8000,0X8000,0X8000,0X8000,0X8000,0X8000,0X8000,0X0000,0X8000,
0X0000,0X8000,0X8000,0X8000,0X8000,0X8000,0X8000,0X8000,0X8000,0X0000,
0X8000,0X0000,0X0000,0X0000,0X8000,0X8000,0X8000,0X8000,0X0000,0X0000,
0X8000,0X0000,0X0000,0X0000,0X8000,0X8000,0X8000,0X8000,0X8000,0X0000,
0X0000,

/* ShengMu M */
0X0000,0X8000,0X8000,0X8000,0X8000,0X8000,0X8000,0X8000,0X8000,0X8000,
0X0000,0X8000,0X0000,0X8000,0X0000,0X8000,0X8000,0X8000,0X8000,0X0000,
0X8000,0X0000,0X0000,0X0000,0X8000,0X0000,0X8000,0X8000,0X0000,0X0000,
0X0000,0X0000,0X0000,0X0000,0X0000,0X0000,0X0000,0X0000,0X8000,0X0000,
0X0000,

/* ShengMu N */
0X0000,0X8000,0X8000,0X8000,0X8000,0X8000,0X8000,0X8000,0X8000,0X8000,
0X0000,0X8000,0X0000,0X8000,0X8000,0X8000,0X8000,0X8000,0X8000,0X0000,
0X8000,0X0000,0X0000,0X0000,0X0000,0X8000,0X8000,0X8000,0X0000,0X0000,
0X8000,0X0000,0X0000,0X0000,0X0000,0X8000,0X8000,0X8000,0X8000,0X0000,
0X0000,

/* ShengMu P */
0X0000,0X8000,0X8000,0X8000,0X8000,0X8000,0X0000,0X8000,0X8000,0X8000,
0X0000,0X8000,0X0000,0X8000,0X0000,0X8000,0X8000,0X8000,0X8000,0X0000,
0X0000,0X0000,0X0000,0X0000,0X8000,0X0000,0X8000,0X8000,0X0000,0X0000,
0X0000,0X0000,0X0000,0X0000,0X0000,0X0000,0X0000,0X0000,0X8000,0X0000,
0X0000,

/* ShengMu Q */
0X0000,0X0000,0X0000,0X0000,0X0000,0X0000,0X0000,0X0000,0X0000,0X0000,
0X0000,0X8000,0X8000,0X8000,0X8000,0X8000,0X8000,0X8000,0X8000,0X8000,
0X8000,0X0000,0X0000,0X0000,0X0000,0X0000,0X0000,0X0EA4,0X0000,0X0000,
0X0EA7,0X0000,0X0EA5,0X0000,0X0EA8,0X0000,0X8E9B,0X8EA0,0X8000,0X8E9E,
0X8EA2,

/* ShengMu R */
0X8F8B,0X0000,0X0000,0X8000,0X8000,0X8000,0X8000,0X0000,0X8000,0X8000,
0X0000,0X0F80,0X0000,0X0000,0X0000,0X0000,0X0000,0X0000,0X0000,0X0000,
0X0000,0X0000,0X0000,0X0000,0X0000,0X8000,0X8000,0X8000,0X8000,0X0000,
0X8000,0X0000,0X0000,0X8000,0X8000,0X8000,0X0000,0X0000,0X8000,0X0000,
0X0000,

/* ShengMu S */
0X908B,0X8000,0X8000,0X8000,0X8000,0X8000,0X8000,0X0000,0X8000,0X8000,
0X0000,0X1080,0X0000,0X0000,0X0000,0X0000,0X0000,0X0000,0X0000,0X0000,
0X0000,0X0000,0X0000,0X0000,0X0000,0X8000,0X8000,0X8000,0X0000,0X0000,
0X8000,0X0000,0X0000,0X8000,0X8000,0X8000,0X0000,0X0000,0X8000,0X0000,
0X0000,

/* ShengMu Sh */
0X918B,0X8000,0X8000,0X8000,0X8000,0X8000,0X8000,0X8000,0X8000,0X8000,
0X0000,0X1180,0X0000,0X0000,0X0000,0X0000,0X0000,0X0000,0X0000,0X0000,
0X0000,0X0000,0X0000,0X0000,0X0000,0X0000,0X8000,0X8000,0X8000,0X8000,
0X8000,0X8000,0X0000,0X8000,0X8000,0X8000,0X0000,0X0000,0X8000,0X0000,
0X0000,

/* ShengMu T */
0X0000,0X8000,0X8000,0X8000,0X8000,0X8000,0X8000,0X8000,0X0000,0X8000,
0X0000,0X8000,0X0000,0X8000,0X0000,0X8000,0X8000,0X0000,0X8000,0X0000,
0X0000,0X0000,0X0000,0X0000,0X0000,0X8000,0X8000,0X8000,0X0000,0X0000,
0X8000,0X0000,0X0000,0X8000,0X8000,0X8000,0X0000,0X0000,0X8000,0X0000,
0X0000,

/* ShengMu W */
0X939B,0X8000,0X8000,0X8000,0X8000,0X0000,0X0000,0X8000,0X8000,0X8000,
0X0000,0X0000,0X0000,0X0000,0X0000,0X0000,0X0000,0X0000,0X0000,0X0000,
0X0000,0X0000,0X0000,0X0000,0X8000,0X0000,0X0000,0X1380,0X0000,0X0000,
0X0000,0X0000,0X0000,0X0000,0X0000,0X0000,0X0000,0X0000,0X8000,0X0000,
0X0000,

/* ShengMu X */
0X0000,0X0000,0X0000,0X0000,0X0000,0X0000,0X0000,0X0000,0X0000,0X0000,
0X0000,0X8000,0X8000,0X8000,0X8000,0X8000,0X8000,0X8000,0X8000,0X8000,
0X8000,0X0000,0X0000,0X0000,0X0000,0X0000,0X0000,0X14A4,0X0000,0X0000,
0X14A7,0X0000,0X14A5,0X0000,0X14A8,0X0000,0X949B,0X94A0,0X8000,0X949E,
0X94A2,

/* ShengMu Y */ 
0X958B,0X8000,0X0000,0X8000,0X8000,0X8000,0X0090,0X0000,0X9591,0X9592,
0X0000,0X1580,0X0000,0X0000,0X0000,0X0000,0X0000,0X1588,0X1589,0X0000,
0X0000,0X0000,0X0000,0X0000,0X8000,0X0093,0X8000,0X00A4,0X0000,0X0000,
0X00A7,0X0000,0X00A5,0X0000,0X00A8,0X0000,0X0000,0X0000,0X8000,0X0000,
0X0000,

/* ShengMu Z */
0X968B,0X8000,0X8000,0X8000,0X8000,0X8000,0X8000,0X8000,0X8000,0X8000,
0X0000,0X1680,0X0000,0X0000,0X0000,0X0000,0X0000,0X0000,0X0000,0X0000,
0X0000,0X0000,0X0000,0X0000,0X0000,0X8000,0X8000,0X8000,0X0000,0X0000,
0X8000,0X0000,0X0000,0X8000,0X8000,0X8000,0X0000,0X0000,0X8000,0X0000,
0X0000,

/* ShengMu Zh  */
0X978B,0X8000,0X8000,0X8000,0X8000,0X8000,0X8000,0X8000,0X8000,0X8000,
0X0000,0X1780,0X0000,0X0000,0X0000,0X0000,0X0000,0X0000,0X0000,0X0000,
0X0000,0X0000,0X0000,0X0000,0X0000,0X8000,0X8000,0X8000,0X8000,0X8000,
0X8000,0X8000,0X0000,0X8000,0X8000,0X8000,0X0000,0X0000,0X8000,0X0000,
0X0000,

	};
#endif /* CHINESE */
